live/01_getting_started/getting_started.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Getting started with perl</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Getting started with perl"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-03-11 08:24:09 AST"/>
<meta name="author" content="Heikki Lehvaslaiho"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Getting started with perl</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Notes URL</a></li>
<li><a href="#sec-2">2 The perl programme structure</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Notes URL</h2>
<div class="outline-text-2" id="text-1">


<p>
<a href="http://baloo-dev.cbrc.kaust.edu.sa/live/">http://baloo-dev.cbrc.kaust.edu.sa/live/</a>
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> The perl programme structure</h2>
<div class="outline-text-2" id="text-2">



<p>
Computer programmes are composed of statements. In perl, every
statement is ended by the semicolon ';' character.
</p>



<pre class="example">#!/usr/bin/env perl
print "Hello!\n";
</pre>


<pre class="example">
Hello!
</pre>


<p>
The execution is one statement at the time from the beginning of the
file. Comments in perl are after a hash '#' character. 
</p>
<p>
You should always use defensive programmings style. it means that you
should protect your programmes from your own and other people's errors.
</p>
<p>
Best way to protect yourself from your own errors: Use the two standard
pragmas (compiler instructions):
</p>



<pre class="example">use strict;
use warnings;
print "Hello\n";
</pre>


<pre class="example">
Hello
</pre>


<p>
Also, you can install a package (Modern::Perl) that does it (and other
beneficial things, like defines the function <b>say</b>) for you.
</p>



<pre class="example">use Modern::Perl;
say "Hello";
</pre>


<pre class="example">
Hello
</pre>


<p>
The way how scripts are turned into executables depends on the
operating system. Unix sets the execute permissions:
</p>



<pre class="example">perl hello.pl
chmod 755 hello.pl
./hello.pl
</pre>



</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-03-11 08:24:09 AST</p>
<p class="author">Author: Heikki Lehvaslaiho</p>
<p class="creator">Org version 7.8.03 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
